<!-- dflook/terraform-github-actions {"workspace":"ghes-graphql","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"08ea7c88ae9af1812a391e21d858c07e251ee6eb8f109ea13c9a4a6ef0282aca","plan_job_ref":"Job Test plan target and replace #351 at https://github.com/dflook/terraform-github-actions/actions/runs/5563632276","plan_hash":"e27d071e2d5eb94a16ccb31e177142e0e6754bc009eabbd3be59b424fb9e8e0c","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __ghes-graphql__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "E7sK8VT2H5" -> (known after apply)
  ~ foreach = "tgtv5l1YFf" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #351](https://github.com/dflook/terraform-github-actions/actions/runs/5563632276)